tiborsimon/embedded-tdd-headers/pic/pic18/pic18f45j10_tdd.h
#define ECCPASE                       522
#define ECCP1DEL                      523
#define PDC0                          524
#define PDC                           525
#define PDC1                          526
#define PDC2                          527
#define PDC3                          528
#define PDC4                          529
#define PDC5                          530
#define PDC6                          531
#define PRSEN                         532
#define BAUDCON                       533
#define ABDEN                         534
#define W4E                           535
#define WUE                           536
#define BRG16                         537
#define SCKP                          538
#define RCMT                          539
#define RCIDL                         540
#define ABDOVF                        541
#define CCP2CON                       542
#define CCP2M                         543
#define CCP2M0                        544
#define CCP2M1                        545
#define CCP2M2                        546
#define CCP2M3                        547
#define DC2B0                         548
#define CCP2Y                         549
#define DC2B                          550
#define DC2B1                         551
#define CCP2X                         552
#define ECCP1CON                      553
#define CCP1M0                        554
#define CCP1M                         555
#define CCP1M1                        556
#define CCP1M2                        557
#define CCP1M3                        558
#define CCP1Y                         559
#define DC1B                          560
#define DC1B0                         561
#define CCP1X                         562
#define DC1B1                         563
#define P1M                           564
#define P1M0                          565
#define P1M1                          566
#define ADCON2                        567
#define ADCS0                         568
#define ADCS                          569
#define ADCS1                         570
#define ADCS2                         571
#define ACQT0                         572
#define ACQT                          573
#define ACQT1                         574
#define ACQT2                         575
#define ADFM                          576
#define ADCON1                        577
#define PCFG0                         578
#define PCFG                          579
#define PCFG1                         580
#define PCFG2                         581
#define CHSN3                         582
#define PCFG3                         583
#define VCFG                          584
#define VCFG0                         585
#define VCFG01                        586
#define VCFG11                        587
#define VCFG1                         588
#define ADCON0                        589
#define ADON                          590
#define nDONE                         591
#define GO_nDONE                      592
#define NOT_DONE                      593
#define GODONE                        594
#define GO_DONE                       595
#define DONE                          596
#define GO_NOT_DONE                   597
#define GO                            598
#define CHS0                          599
#define CHS                           600
#define CHS1                          601
#define CHS2                          602
#define CHS3                          603
#define ADCAL                         604
#define SSPCON2                       605
#define SEN1                          606
#define SSPCON2_SEN                   607
#define ADMSK11                       608
#define SSPCON2_RSEN                  609
#define RSEN1                         610
#define ADMSK1                        611
#define SSPCON2_PEN                   612
#define ADMSK21                       613
#define PEN1                          614
#define ADMSK2                        615
#define ADMSK31                       616
#define SSPCON2_RCEN                  617
#define RCEN1                         618
#define ADMSK3                        619
#define ACKEN1                        620
#define ADMSK41                       621
#define SSPCON2_ACKEN                 622
#define ADMSK4                        623
#define ACKDT1                        624
#define ADMSK51                       625
#define SSPCON2_ACKDT                 626
#define ADMSK5                        627
#define SSPCON2_ACKSTAT               628
#define ACKSTAT1                      629
#define GCEN1                         630
#define SSPCON2_GCEN                  631
#define SSPCON1                       632
#define SSPCON1_SSPM                  633
#define SSPM01                        634
#define SSPCON1_SSPM0                 635
#define SSPM11                        636
#define SSPCON1_SSPM1                 637
#define SSPM21                        638
#define SSPCON1_SSPM2                 639
#define SSPM31                        640
#define SSPCON1_SSPM3                 641
#define SSPCON1_CKP                   642
#define CKP1                          643
#define SSPCON1_SSPEN                 644
#define SSPEN1                        645
#define SSPCON1_SSPOV                 646
#define SSPOV1                        647
#define WCOL1                         648
#define SSPCON1_WCOL                  649
#define SSPSTAT                       650
#define BF1                           651
#define SSPSTAT_BF                    652
#define UA1                           653
#define SSPSTAT_UA                    654
#define SSPSTAT_nW                    655
#define SSPSTAT_R                     656
#define SSPSTAT_NOT_WRITE             657
#define RW1                           658
#define SSPSTAT_nWRITE                659
#define NOT_W                         660
#define SSPSTAT_READ_WRITE            661
#define SSPSTAT_I2C_READ              662
#define RW                            663
#define SSPSTAT_R_nW                  664
#define SSPSTAT_R_W                   665
#define SSPSTAT_R_NOT_W               666
#define SSPSTAT_S                     667
#define START                         668
#define START1                        669
#define SSPSTAT_I2C_START             670
#define STOP                          671
#define SSPSTAT_I2C_STOP              672
#define STOP1                         673
#define SSPSTAT_P                     674
#define SSPSTAT_NOT_ADDRESS           675
#define SSPSTAT_nADDRESS              676
#define SSPSTAT_D_NOT_A               677
#define NOT_A                         678
#define SSPSTAT_D                     679
#define SSPSTAT_nA                    680
#define SSPSTAT_I2C_DAT               681
#define SSPSTAT_DATA_ADDRESS          682
#define SSPSTAT_D_A                   683
#define DA1                           684
#define DA                            685
#define SSPSTAT_D_nA                  686
#define SSPSTAT_CKE                   687
#define CKE1                          688
#define SSPSTAT_SMP                   689
#define SMP1                          690
#define SSPADD                        691
#define MSK01                         692
#define MSK0                          693
#define MSK11                         694
#define MSK1                          695
#define MSK21                         696
#define MSK2                          697
#define MSK3                          698
#define MSK31                         699
#define MSK4                          700
#define MSK41                         701
#define MSK51                         702
#define MSK5                          703
#define MSK61                         704
#define MSK6                          705
#define MSK71                         706
#define MSK7                          707
#define T2CON                         708
#define T2CKPS0                       709
#define T2CKPS                        710
#define T2CKPS1                       711
#define TMR2ON                        712
#define T2OUTPS0                      713
#define TOUTPS0                       714
#define TOUTPS                        715
#define T2OUTPS1                      716
#define TOUTPS1                       717
#define T2OUTPS2                      718
#define TOUTPS2                       719
#define T2OUTPS3                      720
#define TOUTPS3                       721
#define PR2                           722
#define WM0                           723
#define WM1                           724
#define WAIT0                         725
#define WAIT1                         726
#define EBDIS                         727
#define T1CON                         728
#define TMR1ON                        729
#define TMR1CS                        730
#define NOT_T1SYNC                    731
#define T1SYNC                        732
#define nT1SYNC                       733
#define T1INSYNC                      734
#define T1OSCEN                       735
#define SOSCEN                        736
#define T1CKPS0                       737
#define T1CKPS                        738
#define T1CKPS1                       739
#define T1RUN                         740
#define RD16                          741
#define T1RD16                        742
#define RCON                          743
#define BOR                           744
#define NOT_BOR                       745
#define nBOR                          746
#define POR                           747
#define nPOR                          748
#define NOT_POR                       749
#define nPD                           750
#define NOT_PD                        751
#define PD                            752
#define NOT_TO                        753
#define nTO                           754
#define TO                            755
#define nRI                           756
#define NOT_RI                        757
#define RI                            758
#define IPEN                          759
#define WDTCON                        760
#define SWDTE                         761
#define SWDTEN                        762
#define OSCCON                        763
#define SCS0                          764
#define SCS                           765
#define SCS1                          766
#define OSTS                          767
#define IDLEN                         768
#define T0CON                         769
#define T0PS                          770
#define T0PS0                         771
#define T0PS1                         772
#define T0PS2                         773
#define PSA                           774
#define T0SE                          775
#define T0CS                          776
#define T08BIT                        777
#define TMR0ON                        778
#define STATUS                        779
#define C                             780
#define CARRY                         781
#define DC                            782
#define ZERO                          783
#define Z                             784
#define OV                            785
#define OVERFLOW                      786
#define N                             787
#define NEGATIVE                      788
#define INTCON3                       789
#define INT1IF                        790
#define INT1F                         791
#define INT2IF                        792
#define INT2F                         793
#define INT1E                         794
#define INT1IE                        795
#define INT2IE                        796
#define INT2E                         797
#define INT1P                         798
#define INT1IP                        799
#define INT2IP                        800
#define INT2P                         801
#define INTCON2                       802
#define RBIP                          803
#define TMR0IP                        804
#define T0IP                          805
#define INTEDG2                       806
#define INTEDG1                       807
#define INTEDG0                       808
#define RBPU                          809
#define NOT_RBPU                      810
#define nRBPU                         811
#define INTCON                        812
#define RBIF                          813
#define INT0F                         814
#define INT0IF                        815
#define T0IF                          816
#define TMR0IF                        817
#define RBIE                          818
#define INT0E                         819
#define INT0IE                        820
#define T0IE                          821
#define TMR0IE                        822
#define PEIE                          823
#define PEIE_GIEL                     824
#define GIEL                          825
#define GIE_GIEH                      826
#define GIE                           827
#define GIEH                          828
#define STKPTR0                       829
#define STKPTR                        830
#define STKPTR1                       831
#define STKPTR2                       832
#define STKPTR3                       833
#define STKPTR4                       834
#define STKUNF                        835
#define STKOVF                        836
#define STKFUL                        837

#endif // _PIC18F45J10_H_
